
using UnityEngine;

public class ListOfCourceLessons : MonoBehaviour
{
    //Scene - MainMenu

    //L3 - Делаем вьюху для кошелька - Создается префаб для вьюхи кошелька

    //L3 - Промежуточный итог по MVP - Удалили канвас с перфабом и евент систем

    //MainMenuUIRoot
    //L3 - Корневой канвас. Слои UI - Создаем корневой канвас MainMenuUIRoot для всего UI сцены MainMenu
    //L3 - Как получать доступ к слоям
    //L3 - Организация главного экрана - вьюха для главного экрана HUD
    //L3 - Как выглядит стандартная организация попапа - тестовый попап

    //MainMenuScreenView
    //L3 - Организация главного экрана - вьюха для главного экрана HUD
    //L3 - Возвращаем отображение кошелька на главный экран 
    //L3 - Фиксим баг с отображением UI префабов - фиксим отсутствие канваса
    //L3 - Открываем тестовый попап - добавляем кнопку открытия попапа
    //L3 - Тестируем попап - переименовываем на левел меню, обновляем кнопку


    //AntiClicker
    //L3 - Как выглядит стандартная организация попапа
    //L3 - Прикручиваем вьюху к тестовому попапу (2:10)

    //TestPopup
    //L3 - Как выглядит стандартная организация попапа
    //L3 - Прикручиваем вьюху к тестовому попапу
    //L3 - Очередь анимаций.Sequence

    //LevelsMenuPopup
    //L3 - Делаем префаб меню уровней
    //L3 - Разбираем скрипты слоя View
    //L3 - Небольшой бонус - перенастраиваем попап

    //LevelTile
    //L3 - Делаем префаб меню уровней
    //L3 - Разбираем скрипты слоя View - не показана настройка самой кнопки по размерам. Выполняется самостоятельно

    //TestEntity -> Ghost
    //L4 - Тестируем работу с MonoEntity - создаем префаб
    //L4 - Делаем регистрацию Rigidbody
    //L5 - Подготовка к созданию призрака
    //L5 - Добавляем коллайдеры. Механика призрака
    //L5 - Реализуем сквозное движение
    //L5 - Отслеживание контактов. Прикрепляем данные - Добавляем регнистратор коллайдеров
    //L5 - Отключение коллайдеров при смерти.Компоненты - Добавляем возможность отключения коллайдеров

    //CharacterOriginal
    //L5 - Готовим базу под префабы персонажей

    //Ghost1 -> Ghost
    //L5 - Готовим базу под префабы персонажей

    //Hero
    //L5 - Готовим префаб основного героя
    //L5 - Добавляем данные для реализации выстрела - Добавили точку выстрела



}
